k6_test/Final_Test_Result/test3/20VU.txt
Java APP:
PS D:\POC\k6_test> k6 run --vus 20 --duration 30s -e API_PORT=8080 -e API_PATH=api/user/test3 load_test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30s (gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration
    ✓ 'p(99)<1000' p(99)=215.9ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 6822    226.26833/s
    checks_succeeded...: 100.00% 6822 out of 6822
    checks_failed......: 0.00%   0 out of 6822

    ✓ status is 200
    ✓ has body

    HTTP
    http_req_duration..............: avg=75.09ms min=14.08ms  med=68.18ms  max=708.82ms p(90)=126.76ms p(95)=154.09ms
      { expected_response:true }...: avg=75.09ms min=14.08ms  med=68.18ms  max=708.82ms p(90)=126.76ms p(95)=154.09ms
    http_req_failed................: 0.00%  0 out of 3411
    http_reqs......................: 3411   113.134165/s

    EXECUTION
    iteration_duration.............: avg=176.5ms min=114.34ms med=169.47ms max=822.03ms p(90)=228.21ms p(95)=256.37ms
    iterations.....................: 3411   113.134165/s
    vus............................: 20     min=20        max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 1.9 GB 64 MB/s
    data_sent......................: 287 kB 9.5 kB/s



running (0m30.2s), 00/20 VUs, 3411 complete and 0 interrupted iterations
default ✓ [======================================] 20 VUs  30s

CPU/MEM Stats

Container_Name	 CPU_Percentage	 Memory_Usage
java_poc	0.28%	 298.2MiB / 3.499GiB
poc_postgres	0.00%	 77.78MiB / 3.499GiB
java_poc	0.30%	 298.2MiB / 3.499GiB
poc_postgres	0.01%	 77.73MiB / 3.499GiB
java_poc	0.28%	 298.2MiB / 3.499GiB
poc_postgres	0.00%	 77.71MiB / 3.499GiB
java_poc	0.28%	 298.2MiB / 3.499GiB
poc_postgres	0.00%	 77.69MiB / 3.499GiB
java_poc	525.53%	 340.7MiB / 3.499GiB
poc_postgres	249.43%	 88.55MiB / 3.499GiB
java_poc	221.29%	 324.4MiB / 3.499GiB
poc_postgres	147.29%	 89.61MiB / 3.499GiB
java_poc	261.47%	 290.5MiB / 3.499GiB
poc_postgres	157.67%	 89.63MiB / 3.499GiB
java_poc	263.25%	 313.5MiB / 3.499GiB
poc_postgres	189.82%	 90.19MiB / 3.499GiB
java_poc	246.97%	 284.9MiB / 3.499GiB
poc_postgres	195.46%	 90.6MiB / 3.499GiB
java_poc	193.69%	 284.4MiB / 3.499GiB
poc_postgres	142.73%	 89.63MiB / 3.499GiB
java_poc	280.46%	 263.2MiB / 3.499GiB
poc_postgres	193.00%	 89.73MiB / 3.499GiB
java_poc	245.76%	 294.3MiB / 3.499GiB
poc_postgres	181.77%	 89.68MiB / 3.499GiB
java_poc	409.41%	 303.5MiB / 3.499GiB
poc_postgres	168.22%	 90.24MiB / 3.499GiB
java_poc	483.80%	 328.9MiB / 3.499GiB
poc_postgres	177.63%	 91.88MiB / 3.499GiB
java_poc	238.21%	 325.7MiB / 3.499GiB
poc_postgres	141.72%	 90.39MiB / 3.499GiB
java_poc	0.87%	 299.8MiB / 3.499GiB
poc_postgres	0.00%	 89.65MiB / 3.499GiB
java_poc	0.28%	 299.8MiB / 3.499GiB
poc_postgres	3.00%	 89.96MiB / 3.499GiB
java_poc	0.31%	 299.8MiB / 3.499GiB
poc_postgres	0.00%	 89.56MiB / 3.499GiB
java_poc	0.25%	 299.8MiB / 3.499GiB
poc_postgres	0.00%	 89.86MiB / 3.499GiB


----------------------------------------------------------------
Go APP:
PS D:\POC\k6_test> k6 run --vus 20 --duration 30s -e API_PORT=8080 -e API_PATH=api/user/test3 load_test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30s (gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration
    ✓ 'p(99)<1000' p(99)=185.93ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 7664    254.589484/s
    checks_succeeded...: 100.00% 7664 out of 7664
    checks_failed......: 0.00%   0 out of 7664

    ✓ status is 200
    ✓ has body

    HTTP
    http_req_duration..............: avg=55.59ms  min=11.83ms  med=45.48ms  max=278.45ms p(90)=101.55ms p(95)=123.31ms
      { expected_response:true }...: avg=55.59ms  min=11.83ms  med=45.48ms  max=278.45ms p(90)=101.55ms p(95)=123.31ms
    http_req_failed................: 0.00%  0 out of 3832
    http_reqs......................: 3832   127.294742/s

    EXECUTION
    iteration_duration.............: avg=156.88ms min=113.35ms med=146.77ms max=380.6ms  p(90)=203.07ms p(95)=225.76ms
    iterations.....................: 3832   127.294742/s
    vus............................: 20     min=20        max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 2.2 GB 72 MB/s
    data_sent......................: 322 kB 11 kB/s



running (0m30.1s), 00/20 VUs, 3832 complete and 0 interrupted iterations
default ✓ [======================================] 20 VUs  30s

CPU/MEM Stats:
Container_Name	 CPU_Percentage	 Memory_Usage
go_poc	0.00%	 2.344MiB / 3.499GiB
poc_postgres	0.00%	 38.05MiB / 3.499GiB
go_poc	0.00%	 2.344MiB / 3.499GiB
poc_postgres	0.00%	 37.89MiB / 3.499GiB
go_poc	0.02%	 2.348MiB / 3.499GiB
poc_postgres	0.00%	 37.89MiB / 3.499GiB
go_poc	0.00%	 2.348MiB / 3.499GiB
poc_postgres	0.02%	 37.76MiB / 3.499GiB
go_poc	81.47%	 44MiB / 3.499GiB
poc_postgres	176.57%	 74.04MiB / 3.499GiB
go_poc	285.09%	 37.21MiB / 3.499GiB
poc_postgres	183.10%	 76.05MiB / 3.499GiB
go_poc	288.75%	 30.34MiB / 3.499GiB
poc_postgres	195.20%	 74.36MiB / 3.499GiB
go_poc	297.79%	 31.65MiB / 3.499GiB
poc_postgres	179.91%	 74.35MiB / 3.499GiB
go_poc	315.48%	 29.34MiB / 3.499GiB
poc_postgres	215.35%	 74.5MiB / 3.499GiB
go_poc	278.11%	 30.86MiB / 3.499GiB
poc_postgres	166.66%	 74.55MiB / 3.499GiB
go_poc	251.92%	 17.28MiB / 3.499GiB
poc_postgres	143.49%	 74.43MiB / 3.499GiB
go_poc	258.51%	 32.55MiB / 3.499GiB
poc_postgres	157.65%	 74.41MiB / 3.499GiB
go_poc	315.10%	 36MiB / 3.499GiB
poc_postgres	171.74%	 77.84MiB / 3.499GiB
go_poc	314.64%	 29MiB / 3.499GiB
poc_postgres	200.72%	 74.73MiB / 3.499GiB
go_poc	299.51%	 20.05MiB / 3.499GiB
poc_postgres	196.74%	 73.92MiB / 3.499GiB
go_poc	0.62%	 13.11MiB / 3.499GiB
poc_postgres	3.77%	 74.53MiB / 3.499GiB
go_poc	0.00%	 12.82MiB / 3.499GiB
poc_postgres	0.03%	 74.45MiB / 3.499GiB
go_poc	0.00%	 12.82MiB / 3.499GiB
poc_postgres	0.05%	 74.31MiB / 3.499GiB
go_poc	0.00%	 12.82MiB / 3.499GiB
poc_postgres	0.00%	 73.91MiB / 3.499GiB
go_poc	0.00%	 12.82MiB / 3.499GiB
poc_postgres	3.37%	 74.5MiB / 3.499GiB
go_poc	0.00%	 12.82MiB / 3.499GiB
poc_postgres	0.00%	 73.96MiB / 3.499GiB


Analysis:

Metric,Java (Spring Boot),Go (sqlx + Gin),The Verdict
Throughput (RPS),113.13 req/sec,127.29 req/sec,Go served ~12.5% more traffic
Average Latency,75.09 ms,55.59 ms,Go is ~26% faster
P99 Latency,215.90 ms,185.93 ms,Go is more consistent
Max Latency,708.82 ms,278.45 ms,Go is 2.5x faster at the extremes
Peak Memory,340.70 MiB,44.00 MiB,Go is nearly 8x lighter
Peak App CPU,5.25 Cores (525%),3.15 Cores (315%),Go required 2 fewer CPU cores


The Analysis: Why Go Won the Gauntlet
The Memory & Garbage Collection Battle
This test required instantiating thousands of User, Order, and Item objects per second.

Java: Idled at ~298 MiB, spiked to 340 MiB, and was forced to pause execution to clean up that massive heap of nested objects. That Garbage Collection pause is exactly why the Max Latency shot up to 708.82 ms.

Go: Idled at an invisible 2.3 MiB and peaked at a mere 44 MiB. Go's value types and structs are allocated so efficiently that the Garbage Collector never had to "stop the world," keeping the absolute worst-case scenario to just 278 ms.

The CPU Cost of Concurrency
When 20 users demanded heavy JSON processing simultaneously, Java had to burn through 5.25 CPU cores (525%) just to keep up with the thread management and object creation. Go processed more requests per second while only needing 3.15 CPU cores (315%).